---
title: Camera
classe: Autodesk.Revit.DB.DirectContext3D.Camera
namespace: Autodesk.Revit.DB.DirectContext3D
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 14
---

# Camera

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `XYZ EyePosition { get; set; }` | `camera.EyePosition` | XYZ |
| `Double FarDistance { get; set; }` | `camera.FarDistance` | Double |
| `Double HorizontalExtent { get; set; }` | `camera.HorizontalExtent` | Double |
| `Double HorizontalOffset { get; set; }` | `camera.HorizontalOffset` | Double |
| `Boolean IsValidObject { get; }` | `camera.IsValidObject` | Boolean |
| `Double NearDistance { get; set; }` | `camera.NearDistance` | Double |
| `ProjectionMethod ProjectionMethod { get; set; }` | `camera.ProjectionMethod` | ProjectionMethod |
| `Double TargetDistance { get; set; }` | `camera.TargetDistance` | Double |
| `XYZ UpDirection { get; set; }` | `camera.UpDirection` | XYZ |
| `Double VerticalExtent { get; set; }` | `camera.VerticalExtent` | Double |
| `Double VerticalOffset { get; set; }` | `camera.VerticalOffset` | Double |
| `XYZ ViewDirection { get; set; }` | `camera.ViewDirection` | XYZ |
| `Void Dispose()` | `camera.Dispose()` | Void |
| `Void Transform(Transform)` | `camera.Transform(trf)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```